InformationRegisters/НастройкаПодписиСсылочныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПодписиСсылочныхДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаПодписиСсылочныхДанных/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ТипДанных) Тогда
		Элементы.ТипДанных.ТолькоПросмотр = Истина;
	Иначе
		
		МассивВозможныхТипов = Новый Массив;
		Для Каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
			МассивВозможныхТипов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных));
		КонецЦикла;
		Для Каждого ОбъектМетаданных Из Метаданные.ПланыСчетов Цикл
			МассивВозможныхТипов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных));
		КонецЦикла;
		Для Каждого ОбъектМетаданных Из Метаданные.ПланыВидовХарактеристик Цикл
			МассивВозможныхТипов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных));
		КонецЦикла;
		
		// Из списка надо исключить идентификаторы, по которым уже есть записи
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкаПодписиСсылочныхДанных.ТипДанных КАК ТипДанных
		|ИЗ
		|	РегистрСведений.НастройкаПодписиСсылочныхДанных КАК НастройкаПодписиСсылочныхДанных";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЭлементСписка = МассивВозможныхТипов.Найти(Выборка.ТипДанных);
			Если ЭлементСписка <> Неопределено Тогда
				МассивВозможныхТипов.Удалить(ЭлементСписка);
			КонецЕсли;
		КонецЦикла;
		
		МассивВозможныхТипов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочники"));
		МассивВозможныхТипов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных("ПланыСчетов"));
		МассивВозможныхТипов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных("ПланыВидовХарактеристик"));
		
		Элементы.ТипДанных.ПараметрыВыбора = Новый ФиксированныйМассив(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивВозможныхТипов))));
		
	КонецЕсли;
	
	ТипДанных = Параметры.ТипДанных;
	
	ЗаполнитьДеревоРеквизитов();
	
	ОтметитьРеквизитыДереваСогласноЗаписямРегистра();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗаписатьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	ЗаполнитьДеревоРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ТипДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранныйТипДанныхЭтоГруппа(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(,
			НСтр("ru = 'Невозможно выбрать группу объектов метаданных.
			|Выберите объект метаданных.'"));
	КонецЕсли;
	
	Если СтандартнаяОбработка И ВыбранноеЗначение <> ТипДанных И ЗначениеЗаполнено(ТипДанных) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("ТипДанныхОбработкаВыбораЗавершение", ЭтотОбъект, ВыбранноеЗначение),
			НСтр("ru = 'Вид объекта был изменен, список реквизитов будет перезаполнен. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДанныхОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ТипДанных = ДополнительныеПараметры;
		ЗаполнитьДеревоРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставПодписи

&НаКлиенте
Процедура СоставПодписиПометкаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Включить(Команда)
	УстановитьПометки(Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Выключить(Команда)
	УстановитьПометки(Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		
	ИначеЕсли НетОтмеченныхРеквизитов() Тогда
		ПараметрыОповещения = Новый Структура("Закрыть", Ложь);
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьЗавершение", ЭтотОбъект, ПараметрыОповещения),
			НСтр("ru = 'Не отмечено ни одного реквизита. Запись по выбранному виду объекта будет удалена. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да);
	Иначе
		ЗаписатьНаСервере();
		Оповестить("СоставЭПИзменение");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		
	ИначеЕсли НетОтмеченныхРеквизитов() Тогда
		ПараметрыОповещения = Новый Структура("Закрыть", Истина);
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьЗавершение", ЭтотОбъект, ПараметрыОповещения),
			НСтр("ru = 'Не отмечено ни одного реквизита. Запись по выбранному виду объекта будет удалена. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да);
	Иначе
		ЗаписатьНаСервере();
		Оповестить("СоставЭПИзменение");
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтсутствующиеРеквизиты(Команда)
	
	Для Каждого ТекСтрока Из СоставПодписи.ПолучитьЭлементы() Цикл
		Если ТекСтрока.ОтсутствуетВМетаданных Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В метаданных объекта отсутствует реквизит ""%1""'"),
							ТекСтрока.ИмяРеквизита);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтсутствующиеРеквизиты(Команда)
	
	МассивСтрокКУдалению = Новый Массив;
	Для Каждого ТекСтрока Из СоставПодписи.ПолучитьЭлементы() Цикл
		Если ТекСтрока.ОтсутствуетВМетаданных Тогда
			МассивСтрокКУдалению.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
		СоставПодписи.ПолучитьЭлементы().Удалить(СтрокаКУдалению);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОтстутствующиеРеквизиты",
		"Видимость",
		Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗаписатьИЗакрыть(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ЗаписатьНаСервере();
	Оповестить("СоставЭПИзменение");
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыбранныйТипДанныхЭтоГруппа(Значение)
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Значение, "Родитель")) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоРеквизитов()
	
	Если НЕ ОбщегоНазначения.СсылкаСуществует(ТипДанных) Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("СоставПодписи");
	
	Дерево.Строки.Очистить();
	
	МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ТипДанных);
	
	Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		
		Если ПроцессыОбработкиДокументов.НепроверяемыйРеквизит(Реквизит.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДерева = Дерево.Строки.Добавить();
		СтрокаДерева.ИмяРеквизита = Реквизит.Имя;
		СтрокаДерева.Синоним = Реквизит.Синоним;
		СтрокаДерева.Представление = Реквизит.Имя;
		СтрокаДерева.ОписаниеТипов = Реквизит.Тип;
		Для Каждого ТипЗначения Из Реквизит.Тип.Типы() Цикл
			Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
				СтрокаДерева.ПредупреждениеТипДанных = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтрокаДерева.НомерКартинки = 1;
		
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		
		Если ПроцессыОбработкиДокументов.НепроверяемыйРеквизит(Реквизит.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДерева = Дерево.Строки.Добавить();
		СтрокаДерева.ИмяРеквизита = Реквизит.Имя;
		СтрокаДерева.Синоним = Реквизит.Синоним;
		Если ПустаяСтрока(Реквизит.Синоним) Тогда
			СтрокаДерева.Представление = Реквизит.Имя;
		Иначе
			СтрокаДерева.Представление = Реквизит.Синоним + " ["+Реквизит.Имя+"]";
		КонецЕсли;
		СтрокаДерева.ОписаниеТипов = Реквизит.Тип;
		Для Каждого ТипЗначения Из Реквизит.Тип.Типы() Цикл
			Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
				СтрокаДерева.ПредупреждениеТипДанных = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтрокаДерева.НомерКартинки = 1;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "СоставПодписи");
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьРеквизитыДереваСогласноЗаписямРегистра()
	
	ЕстьРеквизитыОтсутвующиеВМетаданных = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкаПодписиСсылочныхДанных.ТипДанных КАК ТипДанных,
	|	НастройкаПодписиСсылочныхДанных.ИмяРеквизита КАК ИмяРеквизита
	|ИЗ
	|	РегистрСведений.НастройкаПодписиСсылочныхДанных КАК НастройкаПодписиСсылочныхДанных
	|ГДЕ
	|	НастройкаПодписиСсылочныхДанных.ТипДанных = &ТипДанных";
	Запрос.УстановитьПараметр("ТипДанных",ТипДанных);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РеквизитНайден = Ложь;
		
		Для Каждого СтрокаДерева Из СоставПодписи.ПолучитьЭлементы() Цикл
			Если Выборка.ИмяРеквизита = СтрокаДерева.ИмяРеквизита Тогда
				РеквизитНайден = Истина;
				СтрокаДерева.Пометка = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// Реквизиты, отсутствующие в метаданных добавляем в дерево с соответствующим признаком
		Если НЕ РеквизитНайден Тогда
			СтрокаДерева = СоставПодписи.ПолучитьЭлементы().Добавить();
			СтрокаДерева.Пометка = Истина;
			СтрокаДерева.ИмяРеквизита = Выборка.ИмяРеквизита;
			СтрокаДерева.Представление = Выборка.ИмяРеквизита;
			СтрокаДерева.НомерКартинки = 4;
			СтрокаДерева.ОтсутствуетВМетаданных = Истина;
			ЕстьРеквизитыОтсутвующиеВМетаданных = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОтстутствующиеРеквизиты",
		"Видимость",
		ЕстьРеквизитыОтсутвующиеВМетаданных);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Пометка, ТолькоПростыеТипы)
	Для Каждого ТекСтрока Из СоставПодписи.ПолучитьЭлементы() Цикл
		Если ТолькоПростыеТипы Тогда
			Если ТекСтрока.ОписаниеТипов.СодержитТип(Тип("Строка")) 
				ИЛИ ТекСтрока.ОписаниеТипов.СодержитТип(Тип("Число")) 
				ИЛИ ТекСтрока.ОписаниеТипов.СодержитТип(Тип("Булево")) 
				ИЛИ ТекСтрока.ОписаниеТипов.СодержитТип(Тип("Дата")) Тогда
				ТекСтрока.Пометка = Пометка;
			КонецЕсли;
		Иначе
			ТекСтрока.Пометка = Пометка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеСсылочныхРеквизитовБезНастройки();
	
	НаборЗаписей = РегистрыСведений.НастройкаПодписиСсылочныхДанных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТипДанных.Установить(ТипДанных);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого СтрокаДерева Из СоставПодписи.ПолучитьЭлементы() Цикл
		Если СтрокаДерева.Пометка Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ТипДанных = ТипДанных;
			НоваяЗапись.ИмяРеквизита = СтрокаДерева.ИмяРеквизита;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаСервере();
		Оповестить("СоставЭПИзменение");
		Если ДополнительныеПараметры.Закрыть Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НетОтмеченныхРеквизитов()
	Для Каждого ТекСтрока Из СоставПодписи.ПолучитьЭлементы() Цикл
		Если ТекСтрока.Пометка Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

&НаСервере
Процедура ПроверитьНаличиеСсылочныхРеквизитовБезНастройки()
	
	Отказ = Ложь;
	
	Для Каждого ТекСтрока Из СоставПодписи.ПолучитьЭлементы() Цикл
		Если НЕ ТекСтрока.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Тип Из ТекСтрока.ОписаниеТипов.Типы() Цикл
			
			Если НЕ ОбщегоНазначения.ЭтоСсылка(Тип)
				Или Перечисления.ТипВсеСсылки().СодержитТип(Тип) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДанныхРеквизита = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип);
			
			НаборЗаписей = РегистрыСведений.НастройкаПодписиСсылочныхДанных.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТипДанных.Установить(ТипДанныхРеквизита);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Реквизит ""%1"" отмечен для включения в электронную подпись.
				|При этом для типа данных ""%2"" не задана настройка свойств для включения в состав электронной подписи.'"),
				ТекСтрока.Представление,
				ТипДанныхРеквизита);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Если Отказ Тогда
		ВызватьИсключение НСтр("ru = 'Отмечены ссылочные реквизиты с незаданной настройкой свойств для включения в состав электронной подписи.'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
